examples/jmeter/stepping.yml
---
execution:
- scenario: simple
  concurrency: 5
  throughput: 25
  ramp-up: 2m
  steps: 5
  #executor: gatling

scenarios:
  simple:
    think-time: 500ms
    requests:
    - http://blazedemo.com


reporting:
- module: passfail
  criteria:
  - avg-rt>5000ms for 5s, stop as failed
- module: junit-xml
  data-source: pass-fail